{
    "Was ist der Zweck von Batch-Dateien und Skripten in Bezug auf Automatisierung?": "Sie werden verwendet, um Routineaufgaben zu automatisieren Beispiele für solche Aufgaben sind Backup/Leeren und Netzwerkaufgaben",
    "Was ist die Geschichte und Entwicklung des Scriptings in der Unix-Shell?": "Die Ausgabe eines Programms kann als Eingabe eines anderen Programms verwendet werden, dies wird als Pipe bezeichnet Die Unix-Shell entstand 1973 Bash ist bis heute die am weitesten verbreitete Unix-Shell Mit dem Aufkommen des WWW folgten weitere Skriptsprachen wie PHP, Python, Ruby",
    "Was sind die Vorteile von Skriptsprachen?": "Einfacher als Programmiersprachen Interpretierung statt Kompilierung Portabilität Datei, die alle Anweisungen enthält",
    "Was sind die Nachteile von Skriptsprachen?": "Beschränkt in Möglichkeiten Wenig geeignet für anspruchsvolle Aufgaben Code unverständlicher als moderne Programmiersprachen",
    "Was ist bash in Bezug auf Automatisierungswerkzeuge?": "Bash ist ein GNU-Ersatz und eine Erweiterung der sh-Shell.",
    "Was ist cmd.exe?": "Cmd.exe ist ein Befehlsinterpreter ab Windows NT.",
    "Was ist Powershell?": "Powershell ist ein Befehlsinterpreter, der auch für Windows Skriptsprachen verwendet wird und als Bibliothek verfügbar ist.",
    "Was ist GNU?": "GNU ist eine Extension Language.",
    "Was ist Lua in Bezug auf Automatisierungswerkzeuge?": "Lua wird zum Einbinden von Code in Programme verwendet.",
    "Was sind VBScript und JScript?": "VBScript und JScript sind Standardskripte in neuen Windows-Versionen.",
    "Was ist Windows Powershell?": "Windows Powershell ist Microsofts Skriptsprache zum Einbinden in .NET-Programme.",
    "Was war die erste Skriptsprache in Webservern?": "Perl",
    "Welche ist die verbreitetste Skriptsprache auf Webservern?": "PHP",
    "Wie kann Python in Bezug auf Webserver verwendet werden?": "Python kann mit einem Webserver verbunden werden Python kann mit einem eigenständigen Webserver verbunden werden",
    "Was ist ein Shell-Skript in Unix und Linux?": "Es ist eine Textdatei Es ist eine Folge von Befehlen für Unix Es fasst eine Reihe von Befehlen in einer Textdatei zusammen Es wird durch das Shell-Command-Line-Interface (CLI) ausgeführt",
    "Wie werden Skriptdateien in Unix und Linux abgearbeitet?": "Skriptdateien werden zeilenweise abgearbeitet Jede Zeile wird vorverarbeitet Besondere Zeichen und Ausdrücke werden analysiert und ggf. ersetzt Dieser Prozess wird als Shell preprocessing bezeichnet",
    "Was repräsentieren geschweifte Klammern und die Tilde in Unix und Linux Shell-Skripten?": "Geschweifte Klammern sind Platzhalter Die Tilde repräsentiert das aktuelle Stammverzeichnis",
    "Wie werden Shellvariablen und arithmetische Ausdrücke in Unix und Linux Shell-Skripten behandelt?": "Shellvariablen werden durch ihren aktuellen Wert ersetzt Arithmetische Ausdrücke werden berechnet",
    "Was bedeutet der Begriff 'Dateinamen aus Wildcards' in Unix und Linux Shell-Skripten?": "Es bezieht sich auf die Verwendung von Wildcards (wie * und ?) zur Darstellung von Dateinamen oder Mustern",
    "Was sind Shell-Befehle?": "Shell-Befehle können interner oder externer Art sein.",
    "Was sind interne Shell-Befehle?": "Interne Shell-Befehle sind vordefinierte Befehle des Kommando-Interpreters.",
    "Was sind externe Shell-Befehle?": "Externe Shell-Befehle sind ausführbare Dateien, die über einen Suchpfad erreichbar sind.",
    "Was ist der Sinn von Shell-Variablen in der Programmierung?": "Shell-Variablen haben den gleichen Sinn wie Variablen in anderen Programmiersprachen.",
    "Wie wird die Interpretation von Shellvariablen durchgeführt?": "Die Interpretation von Shellvariablen ist kontextsensitiv.",
    "Wie können Shell-Variablen gesetzt werden?": "Shell-Variablen können explizit gesetzt werden. Sie können von der Kommandozeile gelesen werden. Sie können aus Umgebungsvariablen extrahiert werden.",
    "Wie werden Shell-Variablen herausgegeben?": "Shell-Variablen werden durch das $-Zeichen herausgegeben.",
    "Was sind Metazeichen und wie werden sie verwendet?": "Metazeichen sind Zeichen, die nicht in Anführungszeichen stehen und Wörter trennen. Sie umfassen Leerzeichen, Tabulatoren und Zeilenumbrüche.",
    "Was sind einige Beispiele für Kontrollstrukturen?": "Beispiele für Kontrollstrukturen sind 'if', 'then', 'else', 'case', 'for loop', 'until loop' und 'while loop'.",
    "Was ist die generelle Syntax in Powershell?": "Die Syntax beginnt mit dem Befehlsnamen Gefolgt von '-<Required Parameter Name>-<Required Parameter Value>' Optional kann ein weiterer Parameter hinzugefügt werden in der Form '<Optional Parameter Name> <Optional Parameter Value>'",
    "Was ist ein Beispiel für einen Befehl in Powershell?": "Ein Beispiel ist 'Get-Childitem' Es hat den Alias 'gei'",
    "Was sind Parameter in Powershell?": "Parameter sind Optionen, die bestimmen, was ein Befehl tut Parameter Namen beginnen mit einem Bindestrich",
    "Was ist ein Parameterwert?": "Es ist der Wert, den ein Parameter benötigt. In einem Syntaxdiagramm wird der Parameterwert durch den .NET-Typ dargestellt.",
    "Was sind Cmdlets und wie sind sie strukturiert?": "Cmdlets sind einfache Befehle. Sie folgen dem Namensschema Verb-Substantiv, wie zum Beispiel Get-PSD-Drive, Set-Location. Sie sind aufgabenorientiert durch das vorangestellte Verb.",
    "Was sind Aliase in Bezug auf Cmdlets?": "Aliase sind alternative Namen, die für Cmdlets erstellt werden können.",
    "Was ist die Bedeutung der Objektorientierung in der Programmierung?": "Ergebnisse einer Funktion werden strukturiert als Objekt dargestellt Dies vereinfacht den gezielten Zugriff auf Attribute",
    "Was sollte man über Ausgabe und Formatierung wissen?": "Dieses Thema sollte im Skript nachgeschlagen werden, da es spezifische Details enthält, die nicht in Stichpunkten zusammengefasst werden können",
    "Was sollte man über Kontrollstrukturen wissen?": "Dieses Thema sollte im Skript nachgeschlagen werden, da es spezifische Details enthält, die nicht in Stichpunkten zusammengefasst werden können",
    "Was ist Pipelining?": "Es ist eine Reihe von Befehlen Diese Befehle sind mit Pipeline-Operatoren verbunden",
    "Wie funktioniert Pipelining?": "Es sendet die Ergebnisse des vorherigen Befehls als Eingabe an den nächsten Befehl",
    "Was ist eine komplexe Befehlskette oder Pipeline?": "Es ist eine Reihe von Befehlen, die durch Pipeline-Operatoren verbunden sind, wobei das Ergebnis eines Befehls als Eingabe für den nächsten Befehl dient",
    "Was sind die vier Möglichkeiten der Dateiausgabe in PowerShell?": "Verwendung von Content und Let's cmdlets Verwendung von Out-File cmdlets Verwendung des Redirection-Operators Verwendung von .NET-Klassen",
    "Was sind die vier Content cmdlets zur Ausgabe in eine Datei?": "Add-Content Clear-Content Get-Content Set-Content",
    "Was macht das Add-Content cmdlet in PowerShell?": "Das Add-Content cmdlet fügt Inhalt am Ende einer Datei hinzu.",
    "Was macht das Clear-Content cmdlet in PowerShell?": "Das Clear-Content cmdlet löscht den Inhalt einer Datei, ohne die Datei selbst zu löschen.",
    "Was macht das Get-Content cmdlet in PowerShell?": "Das Get-Content cmdlet liest den Inhalt einer Datei.",
    "Was macht das Set-Content cmdlet in PowerShell?": "Das Set-Content cmdlet ersetzt den Inhalt einer Datei.",
    "Was passiert, wenn Cmdlets ein Objekt anstelle einer Zeichenfolge übergeben wird?": "Cmdlets konvertieren das Objekt mit der Methode 'To String()' bevor sie es speichern.",
    "Was macht das Cmdlet 'Out-File'?": "Mit dem Cmdlet 'Out-File' wird die Ausgabe an eine Datei gesendet. Es verwendet das Formatierungssystem. Es hat einen Parameter 'Encoding' für die Kodierung der Ausgabe. Standardmäßig ist die Kodierung UTF-8.",
    "Was sind Umleitungsoperatoren in Bezug auf Cmdlets?": "Umleitungsoperatoren leiten die Ausgabe von Cmdlets an andere Orte um. Ein Beispiel für einen Umleitungsoperator ist 'Out-File'.",
    "Was macht der Umleitungsoperator 'Out-File Append'?": "Der Umleitungsoperator 'Out-File Append' fügt die Ausgabe an das Ende einer bestehenden Datei an, anstatt eine neue Datei zu erstellen.",
    "Was sind die Einsatzmöglichkeiten der Microsoft Powershell für lokale Konten?": "Zum Erstellen von Benutzerkonten Verwaltung von lokalen Windows-Benutzerkonten Verwaltung von Microsoft-Konten Verwaltung von Azure Active Directory Konten",
    "Was sind die Möglichkeiten der Powershell für Remoting?": "Bietet viele Möglichkeiten zum Ausführen von Befehlen auf Remote Computern Verfügt über integrierten Computer Name",
    "Was sind Automatisierungsplattformen?": "Automatisierungsplattformen sind Skript-Module, die verwendet werden, um verschiedene Plattformen zu verwalten.",
    "Welche Plattformen können mit Automatisierungsplattformen verwaltet werden?": "Microsoft Azure Windows Exchange SQL Drittanbieter AWS VMware Google Cloud",
    "Was sind Beispiele für Drittanbieter-Plattformen, die mit Automatisierungsplattformen verwaltet werden können?": "AWS VMware Google Cloud"
}